In [2]:
%load_ext sql
%sql mysql://root:password@localhost/pizza_project

In [3]:
%%sql
SHOW TABLES;

 * mysql://root:***@localhost/pizza_project
13 rows affected.

[('customer',),
 ('customerdiscount',),
 ('delivery',),
 ('deliveryperson',),
 ('dessert',),
 ('discountcode',),
 ('drink',),
 ('earningsreport',),
 ('ingredient',),
 ('order',),
 ('orderitem',),
 ('pizza',),
 ('pizzaingredient',)]

In [9]:
%%sql
DESC Dessert;

 * mysql://root:***@localhost/pizza_project
3 rows affected.

[('DessertID', 'int', 'NO', 'PRI', None, ''),
 ('Name', 'varchar(255)', 'YES', '', None, ''),
 ('Price', 'decimal(10,0)', 'YES', '', None, '')]

In [8]:
%%sql
INSERT INTO Dessert (DessertID, Name, Price) VALUES (1, 'Chocolate Cake', 5.00);
SELECT * FROM Dessert;

 * mysql://root:***@localhost/pizza_project
3 rows affected.
(MySQLdb.ProgrammingError) (1064, "You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near '%INSERT INTO Dessert (Dessert_ID, Dessert_Name, Dessert_Price) VALUES (1, 'Choco' at line 1")
[SQL: %%INSERT INTO Dessert (Dessert_ID, Dessert_Name, Dessert_Price) VALUES (1, 'Chocolate Cake', 5.00);]
(Background on this error at: https://sqlalche.me/e/20/f405)